export const customErrors = {
    //+
    4001: {
        message: 'Цей користувач вже заблокований',
    },
    //+
    4002: {
        message: 'Цей користувач вже розблокований',
    },
    //+ auth user
    4003: {
        message: 'Неправильний емейл або пароль',
    },
    //+
    4004: {
        message: 'Token is not present'
    },
    //+
    4005: {
        message: 'Нажаль, такий коментар відсутній'
    },
    //+
    4006: {
        message: 'Нажаль, користувач з такою електронною адресою вже присутній '
    },
    //+
    4007: {
        message: 'Нажаль, такого лікаря немає'
    },
    //+
    4008: {
        message: 'Ця послуга доступна лише для лікаря'
    },
    //+
    4009: {
        message: 'Неправильний емейл або пароль'
    },
    40011: {
        message: 'Така адреса електронної пошти відсутня'
    },
    40014: {
        message: 'Поточний пароль введено невірно'
    },
    //+
    40010: {
        message: 'Ця послуга доступна лише для адміністратора'
    },


    //401 error code
    4011: {
        message: 'Авторизуйтесь, щоб продовжити'
    },

    4012: {
        message: 'Помилка акцесс токену.',
        code: 4012
    },
    4013: {
        message: 'Помилка рефреш токену.',
        code: 4013
    },
    4014: {
        message: 'Помилка відновлення паролю. Час сесії минув'
    },


    //403 error code

    //+
    4031: {
        message: 'Нажаль, така послуга відсутня'
    },

    //+
    4032: {
        message: 'Нажаль, такий користувач заблокований'
    },
    //+
    4033: {
        message: 'Паролі не співпадають. Спробуйте ще раз.'
    },
    //+
    4034: {
        message: 'Помилка відновлення паролю. Час сесії минув.'
    },
    //+
    4035: {
        message: 'Немає жодної спеціальності'
    },
    //+
    4036: {
        message: 'Такого запису на прийом не існує'
    },
    //+
    4037: {
        message: 'Ви не вибрали жодного фото'
    },
    //+
    4038: {
        message: 'Розмір фото не має перевищувати 5 мегабайт',
    },
    //+
    4039: {
        message: 'Ви можете завантажити лише одне фото'
    }
};